[
    {
       "savol":"<img src='../img/1.jpg' alt='rasm'> tenglama  bilan  ifodalangan tebranma harakat qilayotgan jismning  maksimal tezlanishini  toping (sm/<sup>2</sup>)?",
       "A":"70",
       "B":"77",
       "C":"7",
       "D":"0,7"
    },
    {
       "savol":"Uzunligi  10  m  bo‘lgan kir  quritish  arqonida og‘irligi 20 N bo‘lgan  kostum  osilib turibdi. Kostum   ilingan  kiyim  ilgich  arqonining o‘rtasida bo‘lib,  arqon mahkamlangan nuqtalardan o‘tgan gorizontal chiziqdan  10 sm pastda  joylashgan. Arqonning taranglik kuchini  toping?",
       "A":"500 N",
       "B":"40 N",
       "C":"80 N",
       "D":"400 N"
    },
    {
       "savol":"Massasi 50  kg  bo‘lgan bola qayiqdan  qirg‘oqqa sakrab, 0,5 s  ichida  10 m/s tezlik  oldi.  Agar  qayiqning  massasi  200 kg  bo‘lsa,  shu  vaqtda bola qanday  tezlanish oladi?",
       "A":"5 m/s<sup>2</sup>",
       "B":"20 m/s<sup>2</sup>",
       "C":"4,5 m/s<sup>2</sup>",
       "D":"10 m/s<sup>2</sup>"
    },
    {
       "savol":"Velosiped g'ildirakning eng  chekka  nuqtasi 0,02 s  davomida 20 sm yoyni  bosib  o'tdi. Velosipedning tezligini  toping?",
       "A":"5 m/s",
       "B":"10 m/s",
       "C":"31,4 m/s",
       "D":"20 m/s"
    },
    {
       "savol":"Alyuminiydan yasalgan jism kerosinga botirilganda  unga 136 N itaruvchi kuch ta'sir ko'rsatadi. Jismning  havodagi og'irligini  toping. Kerosinning zichligi 800 kg/m^3.",
       "A":"459 N",
       "B":"450 N",
       "C":"360 N",
       "D":"500 N"
    },
    {
       "savol":"Chaqmoq  chaqqandan  so'ng 6 s   o'tgach momoqaldiroq gumburladi,  yashin razryadi kuzatuvchidan qanday  masofada (km) bo'lgan?",
       "A":"3",
       "B":"2",
       "C":"1,5",
       "D":"1"
    },
    {
       "savol":"Otliq 45 km/soat tezlik  bir  qishloqdan ikkinchisiga 30 minda yetib  boradi. Bu  masofani  o'rtacha tezligi 0,5 km/soat bo'lgan toshbaqa qancha  vaqtda o'tishi  mumkin? ",
       "A":"45 soat",
       "B":"60 soat",
       "C":"30 soat",
       "D":"48 soat"
    },
    {
       "savol":"Jismni muvozanat  holatidan  chetga chiqarilganda uning  holatini o'zgartiradigan hech  qanday kuch hosil bo'lmasa ...  deyiladi.",
       "A":"Farqsiz muvozonat",
       "B":"Barchasi  to'gri",
       "C":"Turg'unmas muvozanat",
       "D":"Turg'un  muvozanat"
    },
    {
       "savol":"Quyidagilardan qaysi  biri tabiiy  yorug'lik manbaidir.",
       "A":"Chaqmoq",
       "B":"Oy",
       "C":"Sham",
       "D":"Ko'zgu"
    },
    {
       "savol":"Temperatura kamayishi  bilan moddaning qaysi  holatda diffuziya tezligi  ko'proq kamayadi?",
       "A":"Qattiq",
       "B":"Gaz",
       "C":"Barchasida  bir  xil",
       "D":"Suyuq"
    },
    {
       "savol":"Tomonlari 10 sm  bo'lgan muntazam uchburchakning ikki  uchida -4 nC  va  +4nC bo'lgan  ikki zaryad  joylashgan.  Uchburchakning uchinchi uchidagi maydon  kuchlanganligi nimaga teng?",
       "A":"7,2 kV/m",
       "B":"3,6 kV/m",
       "C":"0",
       "D":"6,6 kV/m"
    },
    {
       "savol":"Ko'char blok ... beruvchi  qurilma.",
       "A":"Kuchni yo'nalishini o'zgartirib",
       "B":"Kuchdan  yutuq",
       "C":"Ishdan yutuq",
       "D":"Yo'ldan yutuq"
    },
    {
       "savol":"Yerga kun va  tun  bo'lishiga  sabab  nima?",
       "A":"Yerning  o'z  o'qidan turlicha  og'ishi ",
       "B":"Yerning o'z  o'qi  atrofida aylanishi",
       "C":"Chunki  yer quyosh  atrofida aylanadi",
       "D":"Yerning  tabiiy yo'ldoshi oy  tufayli"
    },
    {
       "savol":"Soat  strelkasining uchi  qaysi harakat  turiga  kiradi?",
       "A":"Tekis  harakat",
       "B":"Egri chiziqli notekis  harakat",
       "C":"Tezlanuvchan  harakat",
       "D":"Notekis  harakat"
    },
    {
       "savol":"Ipga  bog'langan  jism  O  nuqta  atrofida  vertikal  tekislikda   aylantirilmoqda. B  nuqtada  uning og'irlik  kuchi qanday  yo'nalgan? <img src='../img/2.jpg' alt='rasm'> ",
       "A":"<img src='../img/3.jpg' alt='rasm'> ",
       "B":"<img src='../img/4.jpg' alt='rasm'> ",
       "C":"<img src='../img/5.jpg' alt='rasm'> ",
       "D":"<img src='../img/6.jpg' alt='rasm'> "
    },
    {
       "savol":"Qo'zg'almas blok  orqali o'tkazilgan arqonning uchlariga 50 g va 75 g li  yuklar osilgan. Arqonni  cho'zilmas  deb olib, arqoning taranglik kuchini  toping.",
       "A":"0,6 N",
       "B":"0,4 N",
       "C":"0,8 N",
       "D":"0,5 N"
    },
    {
       "savol":"Yer  uchun  birinchi kosmik  tezlik  u  ga  teng.  Massasi Yer massasidan 4 marta  katta,  radiusi esa 4  marta  kichik  bo'lgan  sayyoradagi  birinchi kosmik tezlikni toping?",
       "A":"4u",
       "B":"16u",
       "C":"2u",
       "D":"u"
    },
    {
       "savol":"Jism  minoradan gorizontal yo'nalishda 12 m/s boshlang'ich tezlik  bilan  otildi va  60 m masofaga borib  yerga  tushdi. Jismning tushish  vaqtini  toping?",
       "A":"4 s",
       "B":"3 s",
       "C":"5 s",
       "D":"6 s"
    },
    {
       "savol":"M massali yog'och brusok gorizontal tekislikda  yotibdi.  Uni F=13,5 N gorizontal kuch  bilan tekis  harakantlantirish mumkin. Brusok ustiga m=2 kg yuk  qo'yilgan holda F=22,3 N kuch ta'sirida tekis harakat qiladigan bo'lsa, yog'och bilan  sirt  orasidagi ishqalanish koeffitsientini  toping?",
       "A":"0,38",
       "B":"0,4",
       "C":"0,5",
       "D":"0,54"
    },
    {
       "savol":"Otliq 48 km/soat tezlik  bilan bir  qishloqdan ikkinchisiga 40 minda yetib bordi. Bu  masofani o'rtacha tezligi 0,5 km/soat bo'lgan toshbaqa qancha  vaqtda  o'tishi  mumkin?",
       "A":"48 soat",
       "B":"64 soat",
       "C":"72 soat",
       "D":"60 soat"
    },
    {
       "savol":"Atmosfera bosimini  o'lchaydigan  asbobga ... deyiladi.",
       "A":"Manometr",
       "B":"Dinamometr",
       "C":"Barometr",
       "D":"Suyuqlikli manometr"
    },
    {
       "savol":"Tovushning tezligi havo temperaturasi ko'tarilishi  bilan ...",
       "A":"O'zgarmaydi",
       "B":"Kamayadi",
       "C":"Ortadi",
       "D":"Ortishi  ham  kamayishi  ham  mumkin"
    },
    {
       "savol":"Arximed kuchini to'g'ri va to'liq ta'rifini  ko'rsating.",
       "A":"Suyuqlik yoki gazga to'la botirilgan jism o'z  hajmiga teng bo'lgan suyuqlik yoki gazni siqib  chiqaradi. Jismga pastdan yuqoriga yo'nalgan va  siqib chiqarilgan suyuqlik yoki gaz og'irligiga teng kuch ta'sir etadi.",
       "B":"Suyuqlik yoki gazga to'la botirilgan jism o'z  hajmiga teng bo'lgan suyuqlik yoki gazni siqib  chiqaradi. Jismga pastdan yuqoriga yo'nalgan jism og'irligiga teng kuch ta'sir etadi.  ",
       "C":"Jismga pastdan yuqoriga yo'nalgan va  jism og'irligiga teng  kuch  ta'sir etadi.",
       "D":"Suyuqlik yoki  gazga to'la botirilgan jism  o'z hajmiga suyuqlik yoki gazni siqib chiqaradi."
    },
    {
       "savol":"Mexanikaning jism  harakatini uning massasi va  uni harakatga  keltiruvchi sabablar hisobga  olinmagan  holda o'rganadigan bo'limiga ... deb  ataladi.",
       "A":"Kinimetka",
       "B":"Elektrostatika",
       "C":"Statika",
       "D":"Dinamika"
    },
    {
       "savol":"Agar yer  sirtidagi jismga  gorizontal yo'nalishda birinchi  kosmik tezlik  berilsa,  uning harakat terektoriyasi qanday  shaklda  bo'ladi?",
       "A":"Ellips",
       "B":"To'g'ri  chiziq",
       "C":"Aylana",
       "D":"Parabola"
    },
    {
       "savol":"Oydagi Kosmik kemadan jismni gorizontal yo'nalishida 3 m/s tezlik bilan otildi. Kosmik kema balandligi 20 m bo'lsa, jism otilgan joydan qanday uzoqlikka borib tushadi? g<sub>oy</sub>=1,6 m/s<sup>2</sup>,  g<sub>y</sub>=10 m/s<sup>2</sup>",
       "A":"6 m",
       "B":"25 m",
       "C":"15 m",
       "D":"20 m"
    },
    {
       "savol":"20 m/s tezlik bilan gorizontal otilgan jismning harakat boshidan 1,5 s o'tgan momentdagi tangensianal tezlanishini  toping(m/s<sup>2</sup>)",
       "A":"8",
       "B":"6",
       "C":"10",
       "D":"5"
    },
    {
       "savol":"Tosh 20 m/s tezlik bilan gorizontga 30<sup>o</sup> burchak ostida  otiladi.  Toshning uchish vaqtini (s) toping?",
       "A":"3",
       "B":"2",
       "C":"4",
       "D":"5"
    },
    {
       "savol":"Gorizontal joylashgan taxtachada yuk turibdi. Yuk va  taxtacha orasidagi ishqalanish koeffitsiyenti 0,1. Taxtachaga gorizontal yo'nalishda qanday a tezlanish berilsa, uning  ustidagi yuk sirpanib  tushadi?",
       "A":"0,5 m/s<sup>2</sup>",
       "B":"2 m/s<sup>2</sup>",
       "C":"1 m/s<sup>2</sup>",
       "D":"0,1 m/s<sup>2</sup>"
    },
    {
       "savol":"Quyosh  toji qanday  fizik  hodisada  kuzatishimiz imkoni  mavjud  bo'ladi?",
       "A":"Quyosh to'la tutilganda",
       "B":"Oy tutilganda",
       "C":"21-dekabrda",
       "D":"22-iyunda"
    },
    {
       "savol":"Atmosfera  bosimini o'lchaydigan  asbobga ... deyiladi",
       "A":"Barometr",
       "B":"Dinamometr",
       "C":"Suyuqlikli manometr",
       "D":"Manometr"
    },
    {
       "savol":"Quyida keltirilgan tarozilarning qaysi birining o'lchash aniqligi kunning  issiq yoki  sovuq bo'lishiga,  Yerning Shimoliy qutbi yoki ekvatorga yaqin joylarda olib borilganligiga bog'liq bo'ladi?",
       "A":"Elektron tarozi",
       "B":"Shaynli tarozi",
       "C":"Prujinali tarozi",
       "D":"Barcha tarozilarda"
    },
    {
       "savol":"Massasi 10  kg bo'lgan jism ikkita cho'zilmas arqonga osilgan. Ular o'zaro 60<sup>o</sup> burchak hosil qilgan holda muvozanatda qoladi. Arqonlarning taranglik kuchlarini hisoblang.",
       "A":"80 N",
       "B":"50 N",
       "C":"100 N",
       "D":"60 N"
    },
    {
       "savol":"Chastotasi 4 MGs bo'lgan to'lqin suvga tushganida qanday chastota  (MGs) bo'ladi? n=4/3",
       "A":"0",
       "B":"4",
       "C":"16/3",
       "D":"3"
    },
    {
       "savol":"Yuqoridan 5 m/s tezlik bilan pastga tashlab yuborilgan jism 5 s dan yerga tushgan bo'lsa, uning o'rtacha tezligini  toping?",
       "A":"55 m/s",
       "B":"30 m/s",
       "C":"25 m/s",
       "D":"20 m/s"
    },
    {
       "savol":"Bir-biriga parchinlab mahkamlangan ikkita- mis va temir plastina (Bimetall plastina). Bunday plastina sovitilsa nima bo'ladi. Issiqlik o'tkazuv-chanlik koeffisentlari temir va mis uchun mos ravishda 73 = 395 W/(m*k)",
       "A":"Temir tomonga egiladi",
       "B":"Sinadi",
       "C":"Mis tomonga egiladi",
       "D":"Egilmaydi"
    },
    {
       "savol":"Qavariq ko'zguda  qanday tasvir  hosil  bo'ladi?",
       "A":"to'nkarilgan, kichiklashgan va mavhum",
       "B":"to'nkarilgan, kichiklashgan va haqiqiy",
       "C":"to'g'ri, kichiklashgan va mavhum",
       "D":"to'nkarilgan, kattalashgan va  haqiqiy"
    },
    {
       "savol":"Atmosfera bosimi mavjudligining sababi nimada?",
       "A":"Molekularning harakatchanligi",
       "B":"Uning Yer yuziga ishqalanilishi",
       "C":"Havoning og'irlik kuchi",
       "D":"Ularning o'zaro ta'sirlashuvi"
    },
    {
       "savol":"Jism pastga tik  yo'nalishda sekinlanuvchan a tezlanish bila harakatlanganda, uning og'irligi ...",
       "A":"ma miqdorda  kamayadi",
       "B":"ma miqdorida ortadi",
       "C":"o'zgarmaydi",
       "D":"tezlanish  qiymatiga bog'liq"
    },
    {
       "savol":"Qarshiligi 0,04 (omega) bo'lgan shunt ampermetr tarmoqqa ulanganda 5 A ni ko'rsatadi. Ampermetrning ichki qarshiligi 0,12(omega)> Zanjirning tarmoqlanmagan qismida tok  kuchini toping.",
       "A":"16 A",
       "B":"20 A",
       "C":"12 A",
       "D":"10 A"
    },
    {
       "savol":"Ichki  bosim  uchun  Paskal  qonuni  quyidagicha  ta'riflanadi:",
       "A":"Og'irlik  kuchini  hisobga  olganda,  suyuqlik yoki  gaz  zarralarining idish  devorlariga bergan  bosimi hamma yo'nalishda bir  xil bo'ladi",
       "B":"Og'irlik  kuchini  hisobga  olmaganda,  suyuqlik yoki  gaz  zarralarining idish  devorlariga bergan  bosimi hamma yo'nalishda bir  xil bo'ladi",
       "C":"Suyuqlik va  gaz o'ziga berilgan tashqi  bosimni hamma  tomonga o'zgarishsiz  uzatadi",
       "D":"Suyuqlik va  gaz o'ziga berilgan tashqi  bosimni hamma  tomonga o'zgarish bilan uzatadi"
    },
    {
       "savol":"Jismni  muvozanat holatidan chetga chiqarilganda uning  holatini o'zgartiradigan hech qanday kuch  hosil bo'lmasa ... deyiladi.",
       "A":"Turg'unmas muvozonat",
       "B":"Farqsiz muvozonat",
       "C":"Barchasi to'g'ri",
       "D":"Turg'un muvozonat"
    },
    {
       "savol":"G'altakdagi tok 0,2 s  davomida noldan 3 A gacha tekis o'zgarganda 1,5 V o'z induksiya EyuK hosil bo'lsa, g'altakning induktivligi qanchaga teng?",
       "A":"0,2 H",
       "B":"1 H",
       "C":"0,1 H",
       "D":"0,5 H"
    },
    {
       "savol":"Interferensiyasi nima?",
       "A":"Kogerent to'lqinlar uchrashganda bir-birini kuchaytirish yoki susaytirish hodisasi",
       "B":"To'lqinlar uchrashganda bir-birini susaytirish hodisasi",
       "C":"Kogerent to'lqinlar uchrashganda bir-birini kuchaytirish hodisasi",
       "D":"To'lqinlar uchrashganda bir-birini kuchaytirish yoki susaytirish hodisasi"
    },
    {
       "savol":"Ko'chmas blok ... beruvchi  qurilma",
       "A":"Ishdan yutuq",
       "B":"Kuchdan yutuq",
       "C":"Kuchni yo'nalishini o'zgartirib",
       "D":"Yo'ldan yutuq"
    },
    {
       "savol":"To'lqin  tarqatayotgan muhitda zarralarning tebranish yo'nalishi , to'lqin tarqalish yo'nalishi bilan bir o'qda bo'lsa, bunday to'lqinga ... deyiladi.",
       "A":"Rezanans",
       "B":"Ko'ndalang to'lqin",
       "C":"Bo'ylanma to'lqin",
       "D":"Xususiy tebranishlar"
    },
    {
       "savol":"Induktivligi 2 H bo'lgan g'altakda o'z induksiya Eyukning qiymati 36 V bo'lishi uchun g'altakdan o'tayotgan tokning o'zgarish tezligi qanday bo'lishi  kerak?",
       "A":"20 A/s",
       "B":"18 A/s",
       "C":"72 A/s",
       "D":"9 A/s"
    },
    {
       "savol":"Ikkita +0,4 uC va -0,6 uC  nuqtaviy zaryadlar bir-biridan 12 sm masofada joylashgan. Zaryadlarni tutashtiruvchi kesma o'rtasida elektr maydon potensiali qanday bo'ladi?",
       "A":"-50 kV",
       "B":"-30 kV",
       "C":"50 kV",
       "D":"30 kV"
    },
    {
       "savol":"Agar massasi 4 kg bo'lgan jismga bir vaqtda 8 N va 22 N kuch ta'sir etayotgan bo'lsa, uning tezlanishi qaysi oraliqda bo'ladi?",
       "A":"[3,5;7,5] m/s<sup>2</sup>",
       "B":"[3;10] m/s<sup>2</sup>",
       "C":"[2;8] m/s<sup>2</sup>",
       "D":"[2,5;8,5] m/s<sup>2</sup>"
    },
    {
       "savol":"2 kg massali jismga gorizontal yo'nalgan 5,2 N kuch ta'sir qilsa , uning tezlanishini toping (m/s<sup>o</sup>). Ishqalanish koeffisienti u=0,04",
       "A":"0,2",
       "B":"2,2",
       "C":"1,6",
       "D":"2,6"
    },
    {
       "savol":"Uzunligi 25 sm bo'lgan o'tkazgichdan 4 A tok o'tmoqda. O'tkazgich induksiyasi 1,2 T bo'lgan bir jinsli magnit maydonning induksiya chiziqlariga 45<sup>o</sup> burchak ostida joylashgan. O'tkazgich Amper kuchi yo'nalishda 3 sm ga ko'chganda qanday ish bajariladi?",
       "A":"15 mJ",
       "B":"25,4 mJ",
       "C":"18,6 mJ",
       "D":"22,5 mJ"
    },
    {
       "savol":"Faradey sonini aniqlang.",
       "A":"9,65*10<sup>4</sup>",
       "B":"8,31",
       "C":"4,5*10<sup>3</sup>",
       "D":"16*10<sup>-19</sup>"
    },
    {
       "savol":"Avtobus o'rtacha 15 m/s tezlik bilan 80 min da qancha masofa bosib o'tadi(km)",
       "A":"72",
       "B":"30,4",
       "C":"54",
       "D":"36"
    },
    {
       "savol":"Ko'ndalang kesim yuzasi 1 m<sup>2</sup>, qalinligi 0,4 m bo'lgan muz bo'lagining massasini toping? Muz zichligi 900 kg/m<sup>3</sup>",
       "A":"360 kg",
       "B":"40 kg",
       "C":"90 kg",
       "D":"400 kg"
    },
    {
       "savol":"60 kg massali bola uzunligi 6 m bo'lgan aravaning boshidan oxiriga tomon 1 m/s tezlik bilan harakat qilgan bo'lsa, bola yerdagi kuzatuvchiga nisbatan qanchaga siljiydi (m)? Aravaning massasi M=120 kg",
       "A":"0",
       "B":"4",
       "C":"2",
       "D":"1,5"
    },
    {
       "savol":"O'zgarmas F kuch ta'sirida vagon 5 m yo'lni bosib o'tdi va 2 m/s tezlik oldi. Agar vagonning massasi 400 kg va ishqalanish koeffisiyenti 0,01 bo'lsa, kuch bajargan A ishning qanday qismi kinetik energiya sarf bo'lgan?",
       "A":"0,8",
       "B":"1",
       "C":"0,2",
       "D":"0,6"
    },
    {
       "savol":"Agar vertikal yuqoriga otilgan jism yo'lning oxirgi 1/4 qismini 3 s da bosib o'tgan bo'lsa, uning harakat boshlangandan so'ng 4 sekunddan keyingi tezligi qanday?",
       "A":"30 m/s",
       "B":"10 m/s",
       "C":"20 m/s",
       "D":"15 m/s"
    },
    {
       "savol":"Elektron magnit maydon induksiyasi 12 mT bo'lgan maydon induksiya chiziqlariga tik uchib kirib, 4 cm radiusli aylana bo;ylab harakatni davom ettirgan bo'lsa, u qanday tezlik bilan maydonga uchib kirgan?",
       "A":"3,2*10<sup>6</sup> m/s",
       "B":"8,4*10<sup>7</sup> m/s",
       "C":"1,8*10<sup>6</sup> m/s",
       "D":"4,4*10<sup>7</sup> m/s"
    },
    {
       "savol":"O'zgaruvchan tok zanjirdagi aktiv qarshilikda tok va kuchlanish fazalari orasidagi farq nimaga bo'ladi?",
       "A":"0",
       "B":"11",
       "C":"-11/2",
       "D":"11/2"
    },
    {
       "savol":"Yangi topilgan planetada  erkin tushish tezlanishi 25 m/s<sup>2</sup> ga teng. Bu planetada uzunligi 1 m bo'lgan matematik mayatnikning siklik chastotasini toping?",
       "A":"5 rad/s",
       "B":"25 rad/s",
       "C":"15 rad/s",
       "D":"10 rad/s"
    },
    {
       "savol":"Jismni muvozonat holatidan chetga chiqarilganda uni dastlabki holatiga qaytaruvchi kuch hosil bo'ladigan muvozonatga ... deyiladi.",
       "A":"potensial energiya",
       "B":"kinetik energiya",
       "C":"issiqlik energiya",
       "D":"ichki energiya"
    },
    {
       "savol":"Gravitatsiya doimiysini birligini  aniqlang?",
       "A":"N*m<sup>2</sup/kg<sup>2</sup>",
       "B":"N*m<sup>3</sup/kg<sup>2</sup>",
       "C":"N*m<sup></sup/kg<sup></sup>",
       "D":"N*kg<sup>2</sup/m<sup>2</sup>"
    },
    {
       "savol":"Vektor kattaliklar - bu ...",
       "A":"son qiymatlari hisobga olinmasa ham bo'ladigan kattaliklar",
       "B":"faqat son qiymati bilan aniqlanadigan kattaliklar",
       "C":"son qiymatlari va yo'nalishilari bilan aniqlanadigan kattaliklar",
       "D":"faqat yo'nalishlari bilan aniqlanadigan kattaliklar"
    },
    {
       "savol":"Gidravlik press deb ataluvchi qurilma qaysi qonun asosida ishlaydi.",
       "A":"Paskal",
       "B":"Momentlar qoidasi",
       "C":"Bernulli",
       "D":"Nyutonning II-qonuni"
    },
    {
       "savol":"Jismlarning tinch yoki harakat  holatini saqlash qobiliyatini xarakterlovchi fizik kattalik ... deyiladi?",
       "A":"Zichlik",
       "B":"Massa",
       "C":"Og'irlik",
       "D":"Inertlik"
    },
    {
       "savol":"Massasi 290 g bo'lgan havoni 20 K ga izobarik qizdirganda u qancha ish bajargan?",
       "A":"2900 J",
       "B":"1700 J",
       "C":"1500 J",
       "D":"1900 J"
    },
    {
       "savol":"Tinch holatdagi 2 kg massali jismga gorizontal yo'nalgan 5 N kuch ta'sir qilsa, uning tezlanishini toping (m/s<sup>2</sup). Ishqalanish koeffitsienti u=0,4",
       "A":"0",
       "B":"4",
       "C":"1,5",
       "D":"0,4"
    },
    {
       "savol":"Yassi kondensator  2uC zaryad olib, 0,5uJ maydon energiyasiga ega bo'ldi. Kondensator sig'imi qanday bo'lgan?",
       "A":"8 uF",
       "B":"16 uF",
       "C":"32 uF",
       "D":"6 uF"
    },
    {
       "savol":"Xumo arenadagi xokkey maydonini kengligi 40 m. Xokkeychi maydon markazidan shaybaga 20 m/s tezlik bersa, shaybaning tebranish davrini  toping (s)? u=0",
       "A":"4",
       "B":"8",
       "C":"6",
       "D":"2"
    },
    {
       "savol":"Temperatura ortishi bilan moddaning qaysi holatida diffuziya tezligi tezroq ortadi?",
       "A":"Qattiq",
       "B":"Gaz",
       "C":"Barchasida bir xil",
       "D":"Suyuq"
    },
    {
       "savol":"Temperatura kamayishi bilan moddaning qaysi holatida diffuziya tezligi tezroq ortadi?",
       "A":"Qattiq",
       "B":"Suyuq",
       "C":"Gaz",
       "D":"Barchasida bir xil"
    },
    {
       "savol":"Vakuumda elektr tokini qanday zarralar hosil qiladi?",
       "A":"Elektronlar",
       "B":"Musbat va manfiy ionlar",
       "C":"Kovaklar",
       "D":"Elektronlar va kovaklar"
    },
    {
       "savol":"Ikkita parallel tokli o'tkazgichlarning har biridan bir tomonga yo'nalgan 2 A tok o'tmoqda. Tokli o'tkazgichlar orasidagi masofa 4 cm. Tokli o'tkazgichlar o'rtasidagi nuqtada magnit maydon induksiyasi nimaga teng?",
       "A":"0,5 mT",
       "B":"0",
       "C":"1,2 mN",
       "D":"0,8 mT"
    },
    {
       "savol":"Induksiyasi 200 mT bo'lgan magnit maydonda uzunligi 50 cm bo'lgan o'tkazgich joylashtirilgan. Undan 4 A tok o'tganda o'tkazgich 3 cm ga surildi. Bunda tok kuchi qanday ish bajargan?",
       "A":"2 mJ",
       "B":"8 mJ",
       "C":"12 mJ",
       "D":"15 mJ"
    },
    {
       "savol":"Teng yarmigicha yerga ko'milgan massasi m=100 kg diametri esa 1 m bo'lgan sharni yer sirtidan balandligi 20 m bo'lgan bino tomiga chiqarish  uchun kran qanday minimal ish bajarish kerak (kJ)? g=10 m/s<sup>2</sup>",
       "A":"22,5",
       "B":"30",
       "C":"20,5",
       "D":"20"
    },
    {
       "savol":"Daryoning kengligi 90 m bo'lib, u to'liq holda muz bilan qoplangan. Daryoning bir qirg'og'idan xokkeychi shaybaga 20 m/s tezlik bersa, shayba ikkinchi qirg'oqdan chiqib asfaltda qanday maksimal masofaga borib to'xtaydi (m)? Muz bilan shayba orasidagi ishqalanish kosffitsineti u=0,1 va asfalt bilan shayba orasidagi ishqalanish koeffitsienti u=0.5",
       "A":"90",
       "B":"50",
       "C":"22",
       "D":"40"
    },
    {
       "savol":"Aylana bo'ylab harakatlanayotgan jismning burchak tezligi vaqt davomida o'zgarib turadigan harakat ... deyiladi.",
       "A":"Aylana bo'ylab tekis harakat",
       "B":"O'zgaruvchan aylanma harakat",
       "C":"O'zgaruvchan harakat",
       "D":"Tekis harakat"
    },
    {
       "savol":"Tokli g'altakdagi magnit maydon induksiyasi 20 mT ga teng. G'altak ichiga ferromagnit o'zagi kiritilganda unda hosil bo'lgan magnit maydon Induksiyasi 180 mT ga ortgan bo'lsa, g'altakka tushirilgan o'zakning magnit singdiruvchanligi nimaga teng?",
       "A":"9",
       "B":"8",
       "C":"10",
       "D":"2"
    },
    {
       "savol":"Eni 4 sm, bo'yi 8 sm  bo'lgan ramka induksiyasi 2 T bo'lgan magnit maydonda joylashgan. Unda 0,5 A tok o'tganda ramkaga ta'sir qilayotgan maksimal kuch momentini toping.",
       "A":"1,6 mN*m",
       "B":"3,2 mN*m",
       "C":"2,3 mN*m",
       "D":"1,2 mN*m"
    },
    {
       "savol":"Tebranma harakat tenglamasi x=0,06cos100pi*t (m) ko'rinishida bo'lgan. Tebranma harakat amplitudasini toping (sm)",
       "A":"6",
       "B":"50 pi",
       "C":"100",
       "D":"0,06"
    },
    {
       "savol":"Minoradan ikki jism 10m/s tezlik bilan birinchisi gorizontga nisbatan 30 burchak ostida pastga va  ikkinchisi esa gorizontal otildi. Harakat boshlangandan 3s vaqt o'tgandan keyingi jismlar balandliklari orasidagi masofa qanday (m)?",
       "A":"15,5",
       "B":"15",
       "C":"4",
       "D":"30"
    },
    {
       "savol":"Agar moddiy nuqta tebranishlari davri 3 s va amplitudasi 4 sm bo'lsa, uning t=36 s harakati davomida ko'chishi qanday (sm) bo'ladi?",
       "A":"0",
       "B":"192",
       "C":"150",
       "D":"90"
    },
    {
       "savol":"Havo molekulalari yer sharini tashlab chiqib keta oladimi?",
       "A":"Xa, chunki ular to'xtovsiz harakat qiladi.",
       "B":"Yo'q,  chunki ular bir-biri bilan to'qnashib tezligi kamayib ketadi",
       "C":"Yo'q, chunki havo molukularining tezligi yetmaydi.",
       "D":"Xa,  chunki ularning massasi juda kichik."
    },
    {
       "savol":"Agar Arximed kuchi jism og'irligidan katta bo'lsa, jism suyuqlikda ... ",
       "A":"Suyuqlik  ichidagi istalgan joyda muallaq holda qoladi",
       "B":"qisman botgan holda suzib yuradi",
       "C":"cho'kadi",
       "D":"Barcha javoblar to'g'ri"
    },
    {
       "savol":"Momentlar qoidasiga asoslanib ishlovchi qurilmani toping?",
       "A":"Qaychi",
       "B":"Shaynli tarozi",
       "C":"Barchasi to'g'ri",
       "D":"Eshik tutqichi"
    },
    {
       "savol":"M massali jismning yerdagi og'irlik kuchi oydagi og'irlik kuchidan qanday farq qiladi? g<sub>oy</sub>=1,6 m/s<sup>2</sup>,  g<sub>yer</sub>=10 m/s<sup>2</sup>",
       "A":"6,25 marta katta",
       "B":"10  marta katta",
       "C":"Farq qilmaydi",
       "D":"6,25 marta kichik"
    },
    {
       "savol":"Qaysi birliklarni tezlanish birligi sifatida ishlatsa bo'ladi? 1) m/s 2 ) m/s^2 3) N/kg  4) J/N*s  5) J/kg*m ",
       "A":"1,4",
       "B":"2,3,4,5",
       "C":"2,3,5",
       "D":"2,3,4"
    },
    {
       "savol":"Tovush qattiqligi qancha bo'lganda inson og'riq sezadi (B)?",
       "A":"40",
       "B":"13",
       "C":"80",
       "D":"130"
    },
    {
       "savol":"Jism pastga tik yo'nalishda a tezlanish bilan harakatlanganda, uning og'irligi ... ",
       "A":"o'zgarmaydi",
       "B":"ma miqdorida kamayadi",
       "C":"tezlanish qiymatiga bog'liq ",
       "D":"ma miqdorga ortadi"
    },
    {
       "savol":"Berilgan sim bo'lagining bikrligi 8*10<sup>3</sup> N/m ga teng. Shu sim  ikkiga bo'linib, birga eshilsa umumiy birlik qanday bo'lib qoladi?",
       "A":"2*10<sup>5</sup> N/m",
       "B":"4*10<sup>5</sup> N/m",
       "C":"32*10<sup>5</sup> N/m",
       "D":"8*10<sup>5</sup> N/m"
    },
    {
       "savol":"Gravitatsiya doimiysini son qiymatini aniqlang.",
       "A":"6,67*10<sup>-11</sup> N*m<sup>2</sup>/g<sup>2</sup>  ",
       "B":"6,67*10<sup>-11</sup> N*m<sup>2</sup>/kg<sup>2</sup>  ",
       "C":"6,67*10<sup>-11</sup> N*sm<sup>2</sup>/kg<sup>2</sup>  ",
       "D":"6,67*10<sup>-9</sup> N*m<sup>2</sup>/kg<sup>2</sup>  "
    },
    {
       "savol":"Jismning muvozonat barqarorroq bo'lishi qaysi parametrlarga bog'liq",
       "A":"tayanch yuzasining kichikligiga,massa markazining quyiroqdaligiga",
       "B":"Barchasi to'g'ri ",
       "C":"tayanch yuzasining kattaligiga, massa  markazining quyiroqdaligiga ",
       "D":"tayanch yuzasining kattaligiga, massa  markazining yuqoriroqdaligiga "
    },
    {
       "savol":"R radiusli sharning  massasi m=800 kg, shunday materialdan tayyorlagan R/2 radiusli shar uchun 100 m masofada turgan bo'lsa, sharlarning tortishish kuchini hisoblang.",
       "A":"2,14*10<sup>-9</sup> N",
       "B":"5,34*10<sup>-10</sup> N",
       "C":"1,07*10<sup>-9</sup> N",
       "D":"3,74*10<sup>-10</sup> N"
    },
    {
       "savol":"Vakuumli diodda anoddagi maksimal tok kuchi 50 mA ga teng bo'ldi. Katoddan har sekundda nechta elektron uchib chiqmoqda?",
       "A":"5,1*10<sup>17</sup> ",
       "B":"3,1*10<sup>17</sup> ",
       "C":"6*10<sup>17</sup> ",
       "D":"3,1*10<sup>15</sup> "
    },
    {
       "savol":"Massasi 800 g, tezligi 36 km/soat bo'lgan jismning impulisini toping (kg*m/s).",
       "A":"80",
       "B":"8",
       "C":"10",
       "D":"6"
    },
    {
       "savol":"Massasi 0,4 kg bo'lgan to'pga 0,01 s  davomida zarb berilganda, u 20 m/s tezlik oldi. To'p qanday kuch bilan tepilgan?",
       "A":"400 N",
       "B":"200 N",
       "C":"800 N",
       "D":"500 N"
    },
    {
       "savol":"Temperatura ortishi bilan diffuziya tezligi qanday o'zgaradi?",
       "A":"Ortadi",
       "B":"Ortishi ham kamayishi ham mumkin",
       "C":"O'zgarmaydi",
       "D":"Kamayadi"
    },
    {
       "savol":"Suyuqliklarda gidrostatik bosimni vujudga kelishiga sabab nima?",
       "A":"Suyuqlik molekulalarining og'irlik kuchi",
       "B":"Molekulalarning harakatchanligi",
       "C":"Paskal qonuniga ko'ra",
       "D":"Yerning harakati sabab"
    },
    {
       "savol":"Qishda 20 m chuqurlikdagi ko'l 5 m qalinlikdagi muz bilan qoplandi. Ko'l tubidagi suvning harorati qancha?",
       "A":"2 <sup>o</sup> C",
       "B":"4 <sup>o</sup> C",
       "C":"1 <sup>o</sup> C",
       "D":"0 <sup>o</sup> C"
    },
    {
       "savol":"Uchinchi kosmik tezlikning qiymati qanday?",
       "A":"7,9 km/s",
       "B":"16,7 km/s",
       "C":"5 km/s",
       "D":"11,2 km/s"
    },
    {
       "savol":"Vaqt birligida jism tezligining o'zgarishiga son jihatdan teng keladigan kattalik ... deb  ataladi?",
       "A":"Maksimal tezlik",
       "B":"Tezlanish",
       "C":"Barchasi to'g'ri",
       "D":"O'rtacha tezlik"
    },
    {
       "savol":"Radiusi 2 sm bo'lgan g'altakdan 3 A tok o'tmoqda. G'altak ichiga magnit singdiruvchanligi 20 bo'lgan ferromagnit o'zagi kiritilsa, g'altak ichidagi magnit maydon induksiyasi qanday bo'ladi? G'altakdagi o'ramlar soni 150 ga teng.",
       "A":"0,28 T",
       "B":"18 T",
       "C":"14 T",
       "D":"2 T"
    },
    {
       "savol":"Magnit maydon oqimi bilan magnit induksiya orasidagi bog'lanish qaysi javobda to'g'ri ko'rsatilgan?",
       "A":"F=B*cos(a)/s",
       "B":"F=B*S*cos(a)",
       "C":"F=I*S",
       "D":"F=u*N*S*I/l"
    },
    {
       "savol":"Metall bo'lagining suvdagi og'irligi 850 N, kerosindagi og'irligi 950 N. Jismning havodagi og'irligini toping. Kerosinning zichligi 800 kg/m<sup>3</sup>.",
       "A":"1050 N",
       "B":"1350 N",
       "C":"1000 N",
       "D":"900 N"
    },
    {
       "savol":"10 s vaqt ichida o'tkazgichdan q=4 C zaryad o'tdi. O'tkazgichdagi kuchlanishi U= 12 V. Tokning bajargan ishini aniqlang.",
       "A":"48 J",
       "B":"480 J",
       "C":"30 J",
       "D":"40 J"
    },
    {
       "savol":"Yassi kondensator qoplamalaridagi kuchlanish 150 V, zaryadi 80uC bo'lsa, kondensatordagi maydon energiyasi nimaga teng?",
       "A":"12 mJ",
       "B":"9 mJ",
       "C":"6 mJ",
       "D":"3 mJ"
    },
    {
       "savol":"Dielektirik singdiruvchanligi 4 va kuchlanganligi 3*10<sup>3</sup> V/m bo'lgan nuqtadagi elektr maydonning energiya zichligini toping.",
       "A":"150 uJ/m<sup>3</sup>",
       "B":"127 uJ/m<sup>3</sup>",
       "C":"159 uJ/m<sup>3</sup>",
       "D":"170 uJ/m<sup>3</sup>"
    },
    {
       "savol":"Massasi 60 kg bola uzunligi 6 m bo'lgan aravaning boshidan oxiriga tomon 1 m/s tezlik bilan harakat qilgan bo'lsa, aravaning massa markazi qanchaga siljiydi (m)? aravaning massasi M=120 kg",
       "A":"2",
       "B":"0",
       "C":"1,5",
       "D":"3"
    },
    {
       "savol":"Tekis tezlanuvchan harakat qilayotgan avtomobil 5 s davomida tezligini 36 km/soat dan 72 km/soat ga oshirdi. Uning tezlanishini toping.",
       "A":"1,8 m/s<sup>2</sup>",
       "B":"7,2 m/s<sup>2</sup>",
       "C":"2 m/s<sup>2</sup>",
       "D":"1,5 m/s<sup>2</sup>"
    },
    {
       "savol":"Elektr toki manbayini 5(omega) li qarshilikka ulanganda zanjirdagi tok kuchi 5 A ga, 2 (omega) li qarshilikka ulanganda zanjirdagi tok kuchi 8 A ga teng bo'ldi. Manbaning Eyuk ni toping. ",
       "A":"30 V",
       "B":"40 V",
       "C":"50 V",
       "D":"35 V"
    },
    {
       "savol":"Dielektrik singdiruvchanligi 4 va kuchlanganligi 3*10<sup>3</sup> v/m bo'lgan nuqtadagi elektr maydonning energiya zichligini toping.",
       "A":"159 uJ/m<sup>3</sup> ",
       "B":"127 uJ/m<sup>3</sup>",
       "C":"170 uJ/m<sup>3</sup>",
       "D":"150 uJ/m<sup>3</sup>"
    },
    {
       "savol":"Havo shari nega geliy yoki vodorod gazlari bilan to'ldiriladi?",
       "A":"Chunki bu gazlar havo bilan ta'sirlashmaydi",
       "B":"Chunki bu gazlar havodan ko'ra yengil",
       "C":"Chunki bu gaz molekularining tezligi boshqa gazlarga qaraganda katta",
       "D":"Chunki bu gazlar tabiatda ko'p miqdorda uchraydi"
    },
    {
       "savol":"Suyuqliklarda idishning yon devoriga gidrostatik bosimni vujudga kelishiga sabab nima?",
       "A":"Suyuqlikning og'irlik kuchi",
       "B":"Molekulalarning harakatchanligi",
       "C":"Paskal qonuniga ko'ra",
       "D":"Yerning harakati sabab"
    },
    {
       "savol":"Nima sababdan pichoq o'tkir bo'lsa, narsalarni kesish oson bo'ladi?",
       "A":"Chunki yuzani kam bo'lishi, kuchni oshishiga sabab bo'ladi.",
       "B":"Chunki kesish kuch momenti katta bo'ladi.",
       "C":"Chunki yuzani kam bo'lishi, bosimni oshishiga sabab bo'ladi.",
       "D":"Chunki kuch ortadi"
    },
    {
       "savol":"Harakat davomida jismning hamma nuqtalari bir xil ko'chsa, bunday harakatga ... harakat deyiladi.",
       "A":"Ilgarilma bo'lmagan",
       "B":"Aylanma",
       "C":"Ilgarilanma",
       "D":"Barchasi to'g'ri"
    },
    {
       "savol":"Nuqtalar o'rnini to'ldiring: Jismlarning o'zaro ta'siri tufayli olgan tezlanishlari ular massalariga ... proporsional bo'lib, o'zaro yo'nalgandir.",
       "A":"to'g'ri; bir yo'nalishda",
       "B":"teskari; qarama qarshi",
       "C":"teskari; bir yo'nalishda",
       "D":"to'g'ri; qarama-qarshi"
    },
    {
       "savol":"Solenoiddan 2,5 A tok o'tganda, unda 0,8 mWb magnit oqimi hosil bo'lsa, magnit maydon energiyasini aniqlang.",
       "A":"2 mJ",
       "B":"1 mJ",
       "C":"0,5 mJ",
       "D":"1,5 mJ"
    },
    {
       "savol":"3 N va 4 N kuchlar bir nuqtada qo'yilgan. Kuch yo'nalishlari orasidagi burchak 90 159 <sup>o</sup>. Teng ta'sir etuvchi kuch moduli qanday (N)?",
       "A":"1",
       "B":"4",
       "C":"5",
       "D":"7"
    },
    {
       "savol":"Massasi m=1 kg bo'lgan jism 45 m balandlikdan 40 m/s tezlik bilan gorizontal otildi. Jismni yerga elastik urilish vaqtidagi yerga ta'sir etayotgan reaksiya kuchini (N) toping? Yerga urilish vaqti t=0.1 s",
       "A":"600",
       "B":"610",
       "C":"10",
       "D":"200"
    },
    {
       "savol":"Massasi 1,2*10<sup>3</sup> kg bo'lgan turba yerda yotibdi. Uning bir uchidan ko'tarish uchun qanday kuch kerak (kN)?",
       "A":"6",
       "B":"12",
       "C":"15",
       "D":"4"
    },
    {
       "savol":"4 N kuch ta'sirida 5 sm uzaygan prujina bikriligini toping.",
       "A":"20 N/sm",
       "B":"80 N/sm",
       "C":"20 N/sm",
       "D":"0,8 N/m"
    },
    {
       "savol":"Reaktiv dvigateldan har sekundda 15 kg gaz 3,2 km/s tezlik bilan chiqmoqda. Dvigatelning tortish kuchi qanday (kN)?",
       "A":"40,8",
       "B":"36",
       "C":"48",
       "D":"24"
    },
    {
       "savol":"Chastotasi 16 Hz dan kichik tovushlarni ... deyiladi",
       "A":"Tebranish",
       "B":"Infratovush",
       "C":"Kamerton",
       "D":"Ultratovush"
    },
    {
       "savol":"Modda atom(molekula)larining potensial energiyasi mavjudligini quyidagi qaysi hodisa ko'rsatib beradi? 1. Muzning erishi 2. Suvning isishi 3. Suvni bug'lanishi",
       "A":"1,2",
       "B":"1,3",
       "C":"2,3",
       "D":"1,2,3"
    },
    {
       "savol":"Momentlar qoidasiga asoslanib ishlovchi qurilmani toping?",
       "A":"Barchasi to'g'ri",
       "B":"Qaychi",
       "C":"Shaynli tarozi",
       "D":"Eshik tutqichi"
    },
    {
       "savol":"Massasi 290 g bo'lgan havoni 20 K ga izobarik qizdirildi. Bunda gazga qancha issiqlik miqdori berilgan (kJ)?",
       "A":"4,25",
       "B":"5,8",
       "C":"1,7",
       "D":"4,1"
    },
    {
       "savol":"Simob metallda issiqlik asosan qanday usulda uzatiladi?",
       "A":"Issiqlik o'tkazuvchanlik",
       "B":"Konveksiya",
       "C":"Nurlanish",
       "D":"Barchasi"
    },
    {
       "savol":"Magnit maydon induksiyasi 3 mT va 4 mT bo'lgan o'zaro tik yo'nalgan ikkita bir jinsli maydonlar qo'shilganda, natijaviy maydonning induksiyasi qanday bo'ladi?",
       "A":"7 mT",
       "B":"5 mT",
       "C":"4 mT",
       "D":"1 mT"
    },
    {
       "savol":"Induktivligi 0,8 H va ko'ndalang kesim yuzi 200 sm<sup>2</sup> bo'lgan g'altak orqali 2 A tok o'tmoqda. Agar g'altak 50 ta o'ramdan tashkil topgan bo'lsa, uning  ichidagi magnit maydon induksiyasi qanday?",
       "A":"1,6 T",
       "B":"0,8 T",
       "C":"1 T",
       "D":"1,5 T"
    },
    {
       "savol":"Magnit maydonning oqimi o'zgarishi tufayli berk konturda elektr tokining hosil bo'lish hodisasini ...",
       "A":"O'z induksiya",
       "B":"Elektromagnit induksiya hodisasi",
       "C":"O'zaro induksiya",
       "D":"Elektr toki"
    },
    {
       "savol":"Alyuminiydan yasalgan jism kerosinga botirilganda unga 136 N kuch ta'sir ko'rsatadi. Jismning hajmini toping. Kerosinning zichligi 800 kg/m<sup>3</sup>",
       "A":"17 dm<sup>3</sup>",
       "B":"15 sm<sup>3</sup>",
       "C":"1 dm<sup>3</sup>",
       "D":"170 sm<sup>3</sup>"
    },
    {
       "savol":"Ikkita yassi ko'zgu parallel qo'yilgan. Ular orasiga buyum qo'yilsa, ko'zgularda nechta tasvir ko'rinadi?",
       "A":"3",
       "B":"4",
       "C":"2",
       "D":"1"
    },
    {
       "savol":"Jismga 11 s davomida 22 N kuch ta'sir etmoqda. Jism impulsning o'zgarishi (kg m/s) topilsin.",
       "A":"242",
       "B":"2",
       "C":"121",
       "D":"0,5"
    },
    {
       "savol":"Elektr toki manbayini 5 (omega) li qarshilikka ulanganda zanjirdagi tok kuchi 5 A ga, 2 (omega) qarshilikka ulanganda zanjirdagi tok kuchi 8 A ga teng bo'ldi. Manbaning ichki qarshiligini toping",
       "A":"5 (omega)",
       "B":"3 (omega)",
       "C":"4 (omega)",
       "D":"6 (omega)"
    },
    {
       "savol":"Ipga bog'langan sharcha muvozonat vaziyatidan chiqarib qo'yib yuborilsa, u 4 s da muvozonat nuqtasiga yetib kelgan bo'lsa, sharchaning tebranish davrini toping?",
       "A":"16 s",
       "B":"8 s",
       "C":"10 s",
       "D":"4 s"
    },
    {
       "savol":"Gorizontal tekislikda turgan og'irligi 6 N bo'lgan yukka gorizontal F=-4 N kuch ta'sirida jism 5=10 m yo'l yurgan bo'lsa, harakat davomida ishqalanish kuchini bajargan ishini aniqlang? u=0,4",
       "A":"16 J",
       "B":"-24 J",
       "C":"0 J",
       "D":"24 J"
    },
    {
       "savol":"Jismni muvozonat holatidan chetga chiqarilganda uning holatini o'zgartiradigan hech qanday kuch hosil bo'lmasa ... deyiladi.",
       "A":"Turg'unmas muvozonat ",
       "B":"Farqsiz muvozonat",
       "C":"Barchasi to'g'ri",
       "D":"Turg'un muvozonat"
    },
    {
       "savol":"Ancha baland nuqtadan bir vaqtda ikki jism gorizontal yo'nalishda o'zaro 90 <sup>o</sup> burchak ostida bir xil 7,1 m/s tezlik bilan otilgan bo'lsa, t=9s dan keyin ular orasidagi masofa necha metrga teng bo'ladi?",
       "A":"73",
       "B":"90",
       "C":"64",
       "D":"32"
    },
    {
       "savol":"Samolyot to'g'ri chiziq bo'ylab 800 km/soat tezlik bilan tekis uchmoqda. Dvigatellarning quvvati 1800 kW va FIK 70 % ga teng bo'lsa, tortish kuchi qancha?",
       "A":"5670 N",
       "B":"11600 N",
       "C":"972 N",
       "D":"1804 N"
    },
    {
       "savol":"Massasi 1200 kg bo'lgan avtomobilni 0,3 m/s<sup>2</sup> tezlanish bilan shatakka olganda, bikrligi 40 kN/m bo'lgan trosning absolyut uzayishi qanday bo'ladi?",
       "A":"90 sm",
       "B":"9 mm",
       "C":"0,9 mm",
       "D":"9 sm"
    },
    {
       "savol":"Noma'lum Sayyora sirtida erkin tushish tezlanishini 25m/s <sup>2</sup> ga teng. Sayyora sirtidan 60 m balandlikdan 5 m/s boshlang'ich tezlik bilan erkin tashlangan jism qancha vaqtda tushadi?",
       "A":"3 s",
       "B":"2 s",
       "C":"9 s",
       "D":"5 s"
    },
    {
       "savol":"Quyidagi javoblarning qaysi birida faqat vektor kattaliklar berilgan? 1) burchak tezlik; 2) kuch yelkasi; 3) ko'chish; 4) kuch; 5) yo'l; 6) tezlik; 7) impuls 8) massa.",
       "A":"1,2,4,6,7",
       "B":"3,4,6,7",
       "C":"1,3,6,7",
       "D":"2,3,4,5,6,7"
    },
    {
       "savol":"6 m/s tezlik bilan yugurib ketayotgan 50 kg massali bola 2 m/s tezlik bilan harakatlanayotgan 40 kg massali aravachani quvib yetdi va uning ustiga chiqib oldi. Aravachaning bola bilan birgalikdagi tezligi qancha?",
       "A":"3,5 m/s",
       "B":"6 m/s",
       "C":"4,2 m/s",
       "D":"5 m/s"
    },
    {
       "savol":"Qiya tekislikda tinch turgan jismga nechta kuch ta'sir qiladi?",
       "A":"1",
       "B":"2",
       "C":"3",
       "D":"Kuch ta'sir qilmaydi"
    },
    {
       "savol":"Kichik yuzali menzurkadagi suv keng yuzali bankaga quyildi. Suvning idish tubiga bergan bosimi qanday o'zgaradi?",
       "A":"Kamayadi",
       "B":"Ortadi",
       "C":"Ortishi ham kamyishi ham mumkin",
       "D":"O'zgarmaydi"
    },
    {
       "savol":"Bo'yi 20,75 m bo'lgan sistemada yerdan 75 sm balandlikdajo'mrak o'rnatilgan. Jo'mrak ochilsa, undan suyuqlik qanday tezlik otilib chiqadi? g=10 m/s<sup>2</sup>",
       "A":"20 m/s",
       "B":"15 m/s",
       "C":"10 m/s",
       "D":"18 m/s"
    },
    {
       "savol":"Maxovik aylanganda gardishdagi nuqtalar tezligi 6 m/s ulardan o'qqa 1,5 sm yaqin masofada bo'lgan nuqtalar tezligi esa5,5 m/s bo'lsa, maxovikning radiusi qancha?",
       "A":"10 sm",
       "B":"18 sm",
       "C":"30 sm",
       "D":"15 sm"
    },
    {
       "savol":"Og'irligi 3 N bo'lgan yukni F=4 N kuch bilan yuqoriga h=10 m balandlikda ko'tarishda qancha ish bajariladi?",
       "A":"40 J",
       "B":"0 J",
       "C":"30 J",
       "D":"20 J"
    },
    {
       "savol":"Lift pastga qarab 4,5 m/s<sup>2</sup> bilan tushmoqda. Undagi jism og'irligi necha marta kamayadi?",
       "A":"2",
       "B":"1,82",
       "C":"1,5",
       "D":"0,55"
    },
    {
       "savol":"10 m/s tezlik bilan gorizontal yo'nalishda otilgan jismning uchish uzoqligi otish balandligiga teng. Jism qanday balandlikdan otilgan (m)?",
       "A":"50",
       "B":"20",
       "C":"40",
       "D":"30"
    },
    {
       "savol":"Quyidagilarning qaysi biri fizk hodisa?",
       "A":"G'ildirakning aylanishi",
       "B":"Suvning qaynashi",
       "C":"Barchasi",
       "D":"Radiodan ovoz chiqishi"
    },
    {
       "savol":"Qanday holatda aylanma bo'ylab harakatda burchak tezlanish yo'nalishlari mos tushadi?",
       "A":"Burchak tezlik harakat davomida o'zgarmasa",
       "B":"Aylanma harakatning burchak tezligi aylanish jarayonida bir tekis kamayib borsa",
       "C":"Burchak tezlik harakat davomida bir tekisda ortib borsa",
       "D":"Bunday holat kuzatilmaydi"
    },
    {
       "savol":"Magnit induksiyasi 4 T bo'lgan bir jinsli magnit maydonda joylashgan yuzasi 250 sm<sup>2</sup> bo'lgan simli ramkadan o'tayotgan magnit oqimi 87 mWb ga teng. Magnit maydon induksiya chiziqlari sirtga qanday burchak ostida tushmoqda?",
       "A":"60",
       "B":"90",
       "C":"30",
       "D":"45"
    },
    {
       "savol":"Magnit maydon induksiya chiziqlariga tik yo'nalishda elektron va proton uchib kirmoqda. Protonning massasi elektronning massasidan 1800 marta katta. Zarralarning qaysi biriga ta'sir ko'rsatgan Lorens kuchi katta bo'ladi?",
       "A":"Ikkalasiga bir xil",
       "B":"Ta'sir kuchi nolga teng",
       "C":"Elektronga",
       "D":"Protonga"
    },
    {
       "savol":"Gorizontga nisbatan burchak ostida otilgan jismning harakati davomida qaysi kattalik doimiy? Havoning qarshiligini inobatga olmang",
       "A":"Gorizontga tezlanish",
       "B":"Vertikal tezlanish",
       "C":"Vertikal tezlik",
       "D":"Urinma tezlanish"
    },
    {
       "savol":"Uzunligi 1,5 m bo'lgan matematik mayatnik lift shiftiga osilgan. Lift pastga 4 m/s<sup>2</sup> tezlanish bilan tushayotgan bo'lsa, mayatnikning tebranish davrini toping?",
       "A":"2,1 s",
       "B":"3,1 s",
       "C":"2,6 s",
       "D":"1,5 s"
    },
    {
       "savol":"Joyidan qo'zg'almas jism 0,3 m/s<sup>2</sup> tezlanish bilan harakat qilib, qancha vaqtda 9 m/s tezlikka erishadi?",
       "A":"50 s",
       "B":"30 s",
       "C":"60 s",
       "D":"40 s"
    },
    {
       "savol":"Jismning yuqoriga tik(vertikal) harakatda qaysi kuchlarni hisobga olmaymiz. 1. Havoning qarshilik kuchi 2. Arximed kuchi 3. Og'irlik kuchi",
       "A":"1,2",
       "B":"1,2,3",
       "C":"2,3",
       "D":"1,3"
    },
    {
       "savol":"Ikki simli o'zgarmas elektr toki uzatish linyasi simlarining har bir metr uzunligiga to'g'ri keluvchi o'zaro ta'sir kuchini hisoblang. Simlar orasidagi masofa 2 m, tok kuchi 50 A ga teng deb oling.",
       "A":"0,5 mN",
       "B":"0,8 mN",
       "C":"0,25 mN",
       "D":"1,2 mN"
    },
    {
       "savol":"Uzunligi 40 sm bo'lgan o'tkazgichdan 2,5 A tok o'tmoqda. O'tkazgich bir jinsli magnit maydonning induksiya chiziqlariga perpendikulyar yo'nalishda 8 sm siljiganda, 32 mJ ish bajarilgan. Magnit maydon induksiyasi nimaga teng?",
       "A":"0,8 T",
       "B":"0,4 T",
       "C":"0,2 T",
       "D":"1,2 T"
    },
    {
       "savol":"800 mol gazni 500 K ga izobarik qizdirishda unga 9,4 MJ issiqlik miqdori berildi. Bunda gaz bajargan ishni aniqlang (MJ).",
       "A":"3,3",
       "B":"6,4",
       "C":"6,1",
       "D":"4,5"
    },
    {
       "savol":"15 m balandlikdan massasi  m=0,2 kg bo'lgan sharcha 10 m/s tezlik bilan tik pastga uloqtirilgan. Sharcha yerga absolyut elastik urilib qaytsa va tezligini 10 % ni yo'qotsa, sharcha yer bilan to'qnashgandagi kuch impulsi aniqlang (N*s)?",
       "A":"7,6",
       "B":"6",
       "C":"0,4",
       "D":"8"
    },
    {
       "savol":"Jism 40 m/s tezlik bilan tik yuqoriga otildi. 5 s dan keyin jismning tezlik moduli qanday bo'ladi? (g= 10 m/s<sup>2</sup>)",
       "A":"10 m/s",
       "B":"20 m/s",
       "C":"5 m/s",
       "D":"15 m/s"
    },
    {
       "savol":"Induksiyasi 50 mT  bo'lgan magnit maydonning induksiya chiziqlari sirt tekisligiga 30<sup>o</sup>  burchak ostida tushmoqda. Magnit maydon induksiyasining sirtiga normal yo'nalishidagi tashkil etuvchisini toping.",
       "A":"25 mT",
       "B":"37 mT",
       "C":"30 mT",
       "D":"50 mT"
    },
    {
       "savol":"Orasidagi masofa 1,6 m bo'lgan qo'sh (ikki) simli o'zgarmas elektr toki uzatish liniyasi simlarining har bir metr uzunligiga to'g'ri keluvchi o'zaro ta'sir kuchini toping. O'tkazgichlardan o'tayotgan tok kuchining qiymatini 40 A ga teng.",
       "A":"200 uN",
       "B":"200 mN",
       "C":"10 uN",
       "D":"20 uN"
    },
    {
       "savol":"Diamagnetiklar uchun magnit singdiruvchanlik kattaligi qanday sohada bo'ladi?",
       "A":"m=0",
       "B":"m>1",
       "C":"m<1",
       "D":"m>=1"
    },
    {
       "savol":"Tomoni 2 m ga teng bo'lgan kub shakldagi muz bo'lagi erib qirrasi 1 m bo'lgan kubga aylandi. Qolgan muzning massasini toping(t)?",
       "A":"7",
       "B":"1",
       "C":"3",
       "D":"8"
    },
    {
       "savol":"Massasi m=2 kg bo'lgan jism, tekis tezlanuvchan harakat qilib 10 sekundda 50 m yo'l yurgan bo'lsa, unga ta'sir qiluvchi kuchni toping (N)?",
       "A":"5",
       "B":"2",
       "C":"4",
       "D":"3"
    },
    {
       "savol":"O'zaro ta'sirlashuvchi jismlarning bir-biriga nisbatan joylashuvi tufayli ega bo'lgan energiyasi ... deb ataladi.",
       "A":"Kinetik energiya",
       "B":"Potensial energiya",
       "C":"Ichki energiya",
       "D":"Issiqlik energiya"
    },
    {
       "savol":"Uchinchi kosmik tezlikning qiymati qanday?",
       "A":"16,7 km/s",
       "B":"5 km/s",
       "C":"7,9 km/s",
       "D":"11,2 km/s"
    },
    {
       "savol":"Jismga boshqa jism ta'sir etmaganda uning tinch yoki to'g'ri chiziqli tekis harakat holatini saqlash xossasiga ... deyiladi.",
       "A":"Inertlik",
       "B":"massa",
       "C":"inersiya",
       "D":"kuch"
    },
    {
       "savol":"Gorzizontga burchak ostida otilgan jismning uchish davomidagi minimal tezligi 16 m/s, uchish vaqti esa 2,4 bo'lsa, u qanday tezlik bilan otilgan (m/s)?",
       "A":"10",
       "B":"16",
       "C":"20",
       "D":"12"
    },
    {
       "savol":"Tebranma harakat tenglamasi x= 0,3cos10t (m) ko'rinishida berilgan. Tebranma harakatning maksimal tezlanishini toping (m/s<sup>2</sup>).",
       "A":"3",
       "B":"30",
       "C":"90",
       "D":"100"
    },
    {
       "savol":"Massasi 2 t bo'lgan jismning hajmi 1 m<sup>3</sup> bo'lsa, u suvda cho'kadimi?",
       "A":"Cho'kmaydi",
       "B":"Cho'kadi",
       "C":"Suv ichida muallaq turadi",
       "D":"Suvning temperaturasiga bog'liq"
    },
    {
       "savol":"Aerostat o'zgarmas 5 m/s tezlik bilan ko'tarila boshlangandan 20 sekund o'tgacha undan jism tushib ketdi. Jism qancha vaqtda yerga tushadi?",
       "A":"5 s",
       "B":"4,45 s",
       "C":"4 s",
       "D":"6 s"
    },
    {
       "savol":"Radiusi 4 sm bo'lgan halqa induksiyasi 0,5 T bo'lgan bir jinsli magnit induksiya chiziqlariga tik joylashtirilgan. Halqadan o'tayotgan magnit oqimi qanday?",
       "A":"25 mWb",
       "B":"30 mWb",
       "C":"18 mWb",
       "D":"20 mWb"
    },
    {
       "savol":"Uzunligi 30 sm bo'lgan o'tkazgichdan 2 A tok o'tmoqda. O'tkazgich induksiyasi 1,5 T bo'lgan bir jinsli magnit maydonning  induksiya chiziqlariga 30<sup>o</sup> burchak ostida joylashgan. O'tkazgich amper kuchi yo'nalishida 4 sm ga ko'chganda qanday ish bajariladi?",
       "A":"18 mJ",
       "B":"9 mJ",
       "C":"15 mJ",
       "D":"27 mJ"
    },
    {
       "savol":"Quyidagi nurlanishlarning qaysi biri eng kichik to'lqin uzunligiga ega?",
       "A":"Rentgen nurlari",
       "B":"Ko'rinadigan nurlar ",
       "C":"Infraqizil nurlar",
       "D":"Ultrabinafsha nurlar"
    },
    {
       "savol":"Buyum botiq ko'zgudan 250 sm masofada turibdi. Ko'zguning fokus masofasi 245 sm. Ko'zgudan tasvirgacha bo'lgan masofani toping.",
       "A":"124 sm",
       "B":"224 sm",
       "C":"184 sm",
       "D":"24 sm"
    },
    {
       "savol":"Massasi 18 kg bo'lgan muz qancha hajmni egallaydi?",
       "A":"22 l",
       "B":"18 l",
       "C":"20 l",
       "D":"15 l"
    },
    {
       "savol":"Tabiati jihatdan qanday bo'lishidan qat'i nazar, kuchlarning jismga bir vaqtdagi ta'siri uning tezligini o'zgartirmasa, moduli jihatidan ... yo'nalgan bo'ladi.",
       "A":"teng va qarama-qarshi",
       "B":"teng va bir xil",
       "C":"farq qiladi va bir xil",
       "D":"farq qiladi va qarama-qarshi"
    },
    {
       "savol":"Spotan nurlanish nima?",
       "A":"Kogerent to'lqinlar hosil bo'ladigan nurlanish",
       "B":"Uyg'ongan holatdagi atomning majburiy nurlanishi",
       "C":"Uyg'ongan holatdagi atomning o'z-o'zidan nurlanishi",
       "D":"To'g'ri javob yo'q"
    },
    {
       "savol":"Otliq 50 km/h tezlik bilan bir qishloqdan ikkinchisiga 30 minda yetib bordi. Bu masofani toshbaqa 40 soatda o'tgan bo'lsa, toshbaqaning o'rtacha tezligi (km/h) qanday bo'lgan?",
       "A":"17,4 sm/s",
       "B":"18 sm/s",
       "C":"15 sm/s",
       "D":"16 sm/s"
    },
    {
       "savol":"10 N kuch  qanday yuzaga 50 kPa bosim beradi(sm<sup>2</sup>)?",
       "A":"2",
       "B":"20",
       "C":"4",
       "D":"0,2"
    },
    {
       "savol":"Quyosh sistemasining tuzilishini birinchi bo'lib kim to'g'ri talqin qilib bergan?",
       "A":"I. Kepler",
       "B":"N. Kopernik",
       "C":"Nyuton",
       "D":"G. Galiley"
    },
    {
       "savol":"M  massali jismning yerdagi o'g'irlik kuchi marsdagi og'irlik kuchidan qanday farq qiladi.",
       "A":"2,8 marta katta",
       "B":"2,8 marta kichik",
       "C":"36 marta katta",
       "D":"Farq qilmaydi"
    },
    {
       "savol":"Ham sirpanib ham dumalab chapga harakatlanayotgan g'ildirakda v<suba>=7m/s va v<subb>=5m/s bo'lsa, C nuqtaning tezligini toping? <img src='../img/fiz1.png' alt='fiz1'>   ",
       "A":"1 m/s",
       "B":"4 m/s",
       "C":"3,5 m/s",
       "D":"3 m/s"
    },
    {
       "savol":"Ideal tebranish konturida kondensator sig'imini 9 marta kamaytirilsa, konturning tebranish chastotasi qanday o'zgaradi",
       "A":"3 marta kamayadi",
       "B":"9 marta kamayadi",
       "C":"o'zgarmaydi",
       "D":"3 marta ortadi"
    },
    {
       "savol":"Suv tubida og'irlik kuchi 3000 N bo'lgan tosh yotibdi. Toshning suv tubidagi yuzasi 60 dm^2 bo'lsa, toshning bosimini toping? Arximed kuchini hisobga olmang",
       "A":"2000 Pa",
       "B":"1800 Pa",
       "C":"5000 Pa",
       "D":"3000 Pa"
    },
    {
       "savol":"Asalari 2 soat davomida asal yig'ish uchun 30km masofani uchib o'tdi. Uning o'rtacha tezligi nimaga teng?",
       "A":"27,7 km/h",
       "B":"4,17 m/s",
       "C":"3,94 m/s",
       "D":"12 km/h"
    },
    {
       "savol":"Hajmi 80 m^3 bo'lgan muzning massasi qancha (kg)",
       "A":"50",
       "B":"72",
       "C":"80",
       "D":"40"
    },
    {
       "savol":"Dnamometrga yuk osilganda,uning ko'rsatishi 24,5 N ga teng bo'ladi.Unga qanday massali yuk osilgan?",
       "A":"5",
       "B":"3",
       "C":"2,5",
       "D":"2,45"
    },
    {
       "savol":"Yuzasi 0,1 sm^2 bo'lgan mixga 20 N kuch bilan ta'sir etsa, bosimi qanchaga teng bo'ladi?",
       "A":"45kPa",
       "B":"200kPa",
       "C":"180kPa",
       "D":"20 kPa"
    },
    {
       "savol":"Moddiy nuqta S masofada o'z tezligini 0dan 14,1 m/s gacha oshirgan bo'lsa, keyingi S yo'lda jisimning tezligi qanchaga ortagan? (14,1^2=200 deb olinsin)",
       "A":"5,9 m/s",
       "B":"10 m/s",
       "C":"20 m/s",
       "D":"4,1 m/s"
    },
    {
       "savol":"Kamondan o'q 24 m/s tezlik bilan vertikal ravishda yuqoriga otildi.Qanday balandlikda (m) uning knetik energiyasi potensial energiyasiga teng bo'lishini aniqlang. (g=10 m/s^2)",
       "A":"3,6",
       "B":"14,4",
       "C":"12,4",
       "D":"7,2"
    },
    {
       "savol":"Massasi 100 g bo'lgan sharcha gorizontal sirtda 0,5 m/s tezlik bilan ikkinchi sharchaga urildi va 0,2 m/s tezlikda o'z harakatini avvalgi yo'nalishda davom ettridi. Urilish paytida sharchaning Impulsi qanchaga o'zgargan?",
       "A":"50 mN*s",
       "B":"30 mN*s",
       "C":"-30 mN*s",
       "D":"-50 mN*s"
    },
    {
       "savol":"Oy sirtidan 20 m balandlikdan jisim yuqoriga 6 m/s tezlik bilan otildi.Jisim qancha vaqdan keyin Oy sirtiga tushadi?(g<sub>oy=1,6 m/s^2",
       "A":"3,5 s",
       "B":"3 s",
       "C":"2,5 s",
       "D":"10 s"
    },
    {
       "savol":"45 m balandlikdan erkin tashlab yuborilgan metal sharcha yerga elastik urilib, 5 m balandlikka ko'tarildi. Yerga urilish vaqtidagi sharcha impulsining o'zgarishini toping (kg*m/s).m=5 kg, g=10 m/s^2",
       "A":"50",
       "B":"150",
       "C":"100",
       "D":"200"
    },
    {
       "savol":"Jismni muvozonat holatidan chetga chiqarilganda uni dastlabki holatiga qaytaruvchi kuch hosil bo'ladigan muvozonatga ... deyiladi.",
       "A":"2,4 m/s^2",
       "B":"1,96 m/s^2",
       "C":"2,56 m/s^2",
       "D":"1,33 m/s^2"
    },
    {
       "savol":"Tosh binoning ikkinchi qavatidan 4 m balandlikdagi oynadan otildi. Tosh bino asosidan 3 m masofaga borib tushgan bo'lsa, uning ko'chishini toping?",
       "A":"3",
       "B":"5",
       "C":"4",
       "D":"7"
    },
    {
       "savol":"F kuch tasirida m<sub 1> mssali jisim 2 m/s^2 tezlanish oladi.m<sub 2> massali jisim esa, shu kuch tasirida 5 m/s^2 tezlanish oladi. Bu jisimlar o'zaro ulansa, ular shu kuch ta'sirida qanday tezlanish bilan harakatlanadi?",
       "A":"1,5 m/s^2",
       "B":"2,5 m/s^2",
       "C":"1,43 m/s^2",
       "D":"0,5 m/s^2"
    },
    {
       "savol":"Eni 4 sm, bo'yi 8 sm  bo'lgan ramka induksiyasi 2 T bo'lgan magnit maydonda joylashgan. Unda 0,5 A tok o'tganda ramkaga ta'sir qilayotgan maksimal kuch momentini toping.",
       "A":"Eshik tutqichi",
       "B":"Shayinli tarozi",
       "C":"Barchasi to'g'ri",
       "D":"Qaychi"
    },
    {
       "savol":"Agar Arximed kuchi jism og'irligiga teng bo'lsa, jism...",
       "A":"suyuqlikda cho'kadi",
       "B":"suyuqlikda qisman botgan holda suzib yuradi",
       "C":"barchasi to'g'ri",
       "D":"suyuqlik ichidagi istalgan joyda muallaq holda qoladi"
    },
    {
       "savol":"Nima sababdan iganing uchi o'tkir bo'ladi?",
       "A":"Kuch momentini oshirish uchun",
       "B":"Bosimni oshirish uchun",
       "C":"O'lchami qulay bo'lishi uchun",
       "D":"Kuchni oshirish uchun"
    },
    {
       "savol":"Nuqtalar o'rnini to'ldiring. Jismlarning o'zaro ta'siri tufayli olgan tezlanishlari ular massalariga ...proporsional bo'lib, o'zaro ... yo'nalgandir.",
       "A":"teskari; bir yo'nalishda",
       "B":"to'g'ri; bir yo'nalishda",
       "C":"to'g'ri; qarama qarshi",
       "D":"teskari;qaramaqarshi"
    },
    {
       "savol":"Agar yer sirtidagi jismga gorizontal yo'nalishda birinchi kosmik tezlik berilsa, uning harakat trayektoriyasi qanday shaklda bo'ladi",
       "A":"Parabola",
       "B":"Ellips",
       "C":"Aylana",
       "D":"To'g'ri chiziq"
    },
    {
       "savol":"Aylanish o'qiga ega bo'lgan jism yoki jismlar sistemasi muvozanatda qolishi uchun unga ta'sir etayotgan kuchlarning... nolga teng bo'lishi kerak",
       "A":"vektor yig'indisi",
       "B":"momentlar skalyar yig'indisi",
       "C":"skalyar yig'indisi",
       "D":"momentlar vektor yig'indisi"
    },
    {
       "savol":"Kuch qo'yilgan nuqtadan, aylanish o'qigacha bo'lgan... masofaga kuch yelkasi deb ataladi",
       "A":"ikkilangan eng qisqa",
       "B":"eng uzoq",
       "C":"To'g'ri javob berilmagan",
       "D":""
    },
    {
       "savol":"O'tkazgch halqa orqali o'tgan magnit oqim 0,2 s davomida 5 mWb ga o'zgargan. Halqa 0,25 om elektir qarshiligiga ega bo'lsa, halqada qanday induksion tok yuzaga keladi",
       "A":"0,1 A",
       "B":"1 A",
       "C":"0,2 A",
       "D":"0,5 A"
    },
    {
       "savol":"Magnit induksiyasi 0,3 T bo'lgan bir jinsli magnit maydoniga induksiya chiziqlari perpendikulyar ravishda 160 Mm/s tezlik bilan uchib kirgan elektronning harakat trayektoriyasining egrilik radusini toping",
       "A":"12 mm",
       "B":"5 mm",
       "C":"6 mm",
       "D":"3 mm"
    },
    {
       "savol":"Magnit maydon induksiyasi 0,50 T bo'lgan o'zaksiz g'altakka magnit  singdruvchanligi 60 ga teng bo'lgan ferromagnit kiritildi. G'altak ichida magnit maydon induksiyasi qanchaga o'zgaradi",
       "A":"30 T",
       "B":"0,5 T",
       "C":"20 T",
       "D":"29,5 T"
    },
    {
       "savol":"Vin siljitish qonuniga ko'ra temperatura kamaysa, nurlanishning maksimal to'lqin uzinligi qanday o'zgaradi",
       "A":"nurlanishning maksimal to'lqin to'lqin uzunligiga bog'liq emas",
       "B":"uzun to'lqin uzunliklari uzun tomonga siljiydi",
       "C":"modda turiga bog'liq ",
       "D":"Qisqa to'lqin uzunlik tomonga siljiydi"
    },
    {
       "savol":"Linzaning optik markazi deb nimaga aytiladi",
       "A":"linzadan o'tadigan nurlar bir nuqtadan to'planadigan joy",
       "B":"Optik o'qda yotgan linza markazida yotgan",
       "C":"Linzaning optik markazi mavjud emas",
       "D":"to'gri javob berilmagan"
    },
    {
       "savol":"Jismlar muvozanat holatidan chetga chiqarilganda uning holatini o'zgartiradigan hech qanday kuch hosil bo'lmasa... deyiladi",
       "A":"Barchasi to'g'ri",
       "B":"Turg'un mvozanat",
       "C":"Turg'unmas muvozanat",
       "D":"Farqsiz muvozanat"
    },
    {
       "savol":"Yerda kun va tun bo'lishiga sabab nima",
       "A":"Yerning tabiiy yo'ldoshi oy tufayli",
       "B":"Yerning o'z o'qi atrifida aylanishi",
       "C":"Yer o'z o'qi atrofida turlicha og'ishi",
       "D":"Chunki yer quyosh atrofida aylanadi"
    },
    {
       "savol":"Jismni Yerga tortish kuchi...deyiladi",
       "A":"Jismning vazni",
       "B":"Jismning og'irligi",
       "C":"Og'irlik kuchi",
       "D":"Inversiya kuchi"
    },
    {
       "savol":"Metallni qizdirish tufayli ulardan elektron uchib chiqish hodisasiga ... deyiladi",
       "A":"termoelektron emisiyasi",
       "B":"to'yinish toki",
       "C":"chiqish ishi",
       "D":"elektr emissiya"
    },
    {
       "savol":"Inersiya kuchi jismga boshqa jismlar tomonidan emas, balki... ta'sir qiladi",
       "A":"inersial sanoq sistema tomonidan",
       "B":"inersial bo'lmagan sanoq sistema",
       "C":"sanoq sistema tezlanish bilan harakatlanishi tufayli",
       "D":"to'g'ri javob yo'q"
    },
    {
       "savol":"Magnit maydonga turgan yuzi 80 cm^2 bo'lgan ramkaga ta'sir qiluvchi maksimal kuch momenti 7,2 mNm ga teng. Agar ramkadan 0,2 A tok o'tayotkan bo'lsa maydon induksiyasi nmaga teng",
       "A":"2,3  T",
       "B":"1,2 T",
       "C":"2 T",
       "D":"1,4 T"
    },
    {
       "savol":"Magnit oqimining o'zgarish tezligi 0,15 Wb/s bo'lganda, 120 V(EYukK) hosil bo'lsa, g'altakdagi o'ramlar soni nechta bo'lgan",
       "A":"800",
       "B":"150",
       "C":"510",
       "D":"650"
    },
    {
       "savol":"Yarim o'tkazgichlarga nur ta'sir etishi natijasida unda erkin zaryad tushuvchilarning hosil bo'lishiga ... deyiladi",
       "A":"fotoo'tkazuvchanlik",
       "B":"tashqi fotoefekt",
       "C":"qutblanish",
       "D":"ichki fotoefekt"
    },
    {
       "savol":"Atom... tashkil topgan",
       "A":"elektron va fotonlar",
       "B":"elektron va nuklonlar",
       "C":"proton va neytronlar",
       "D":"proton va elektronlardan"
    },
    {
       "savol":"Jismning havodagi og'irligi 196 N, kerosidagi og'irligi 180 N. Jismning hajmini toping. Kerosinning zichligi 800kg/m^3",
       "A":"200 sm^3",
       "B":"2 dm^3",
       "C":"20 dm^3",
       "D":"2 sm^3"
    },
    {
       "savol":"Yer sirtidagi atmosfera bosimi 750 mm.sim.ust ga teng bo'lsa, balandligi 120 bo'lgan  binonig tomidagi bosimini toping",
       "A":"760 mm sim ust",
       "B":"740 mm sim ust",
       "C":"10 mm sim ust",
       "D":"750 mm sim ust "
    },
    {
       "savol":"9 m/s necha... km/h ga teng",
       "A":"30,4",
       "B":"32,2",
       "C":"31,2",
       "D":"33,6"
    },
    {
       "savol":"Suv tubida og'irligi 3000 N bo'lgan tosh yotibdi. Toshning suv tubidagi yuzasi 60 dm^2 bo'lsa toshning bosimini toping. Arxmed kuchini hisobga olmang",
       "A":"3000 Pa",
       "B":"5000 Pa",
       "C":"1500 Pa",
       "D":"2000 Pa"
    },
    {
       "savol":"Massasi 54 kg bo'lgan muz qancha hajmni egallaydi (m^3)",
       "A":"0,06",
       "B":"60",
       "C":"6",
       "D":"0,6"
    },
    {
       "savol":"Jismning massasi m= 28 kg bo'lsa unga tasir etayotgan og'irlik kuchini toping",
       "A":"280 N",
       "B":"250 N",
       "C":"285 N",
       "D":"275 N"
    },
    {
       "savol":"Ma'lum balandlikdan qo'yib yuborilgan  jisim erkin tushmoqda. U 40 m/s tezlikka erishganida qancha masofa bosib o'tgan bo'ladi (g=10 m/s^2",
       "A":"60 m",
       "B":"80 m",
       "C":"100 m",
       "D":"120 m"
    },
    {
       "savol":"Joyidan qo'zg'alib, 0,2 m/s^2 tezlanish bilan tezlanuvchan  harakat qilayotgan jism 12 s qancha yo'lni bosib o'tdi",
       "A":"12,2 m",
       "B":"25 m",
       "C":"14,4 m",
       "D":"20 m"
    },
    {
       "savol":"Potensial energiya deb nimaga aytiladi",
       "A":"jismlar harakatlanganda",
       "B":"jismlarni tinch turganda hosil bo'ladigan energiyaga",
       "C":"jismlarning o'zaro ta'sir natijasida hosil bo'lgan energiyaga",
       "D":"jismlarning o'zaro ta'siri va harakatidan hosil bo'lgan energiya"
    },
    {
       "savol":"Suyuqlikning oqim tezligi katta bo'lgan joylarida uning bosimi... va aksincha oqim tezligi kicik bo'lgan joylarida...bo'ladi",
       "A":"kichik katta",
       "B":"kichik nol",
       "C":"katta nol",
       "D":"katta kichik"
    },
    {
       "savol":"Jismning yerga tortishish kuchi ... deb ataladi",
       "A":"jismning vazni",
       "B":"og'irlik kuchi",
       "C":"jismning og'irligi",
       "D":"inersiya kuchi"
    },
    {
       "savol":"Deformatsiyalangan jismda vujudga kelib tashqi kuchga ... ko'rsatadigan va unga qarama-qarshi yo'nalish ... deb ataladi",
       "A":"qarshilik va lorens kuchi",
       "B":"qarshilik va ishqalanish kuchi",
       "C":"qarshilik va elastiklik kuchi",
       "D":"qarshilik va amper kuchi"
    },
    {
       "savol":"Amplutuda qiymati 30 V bo'lgan o'zgaruvchan tok zanjiriga rezistor ulanganda unda 2 A tok o'tdi. Rezistorda ajralgan o'rtacha quvvatni toping",
       "A":"90 W",
       "B":"60 W",
       "C":"30 W",
       "D":"45 W"
    },
    {
       "savol":"250 o'ramga ega bo'lgan g'altak ichida magnit maydon oqimi 0,4 s da 2 Wb ga o'zgardi. G'altakda hosil bo'lgan induksiya EYuKni toping",
       "A":"1250 V",
       "B":"1500 V",
       "C":"2600 V",
       "D":"1000 v"
    },
    {
       "savol":"Induktivligi 5 mH bo'lgan g'ltakdan 4 A tok o'tmoqda. G'altakning magnit maydoni energiyasini toping",
       "A":"15 mJ",
       "B":"40 mJ",
       "C":"50 mJ",
       "D":"20 mJ"
    },
    {
       "savol":"Radusi 5 cm bo'lgan sim  halqadan 3 A tok oqmoqda. Halqa markazidagi magnit maydon induksiyasini aniqlang",
       "A":"37,7 мT",
       "B":"30 мT",
       "C":"27 мT",
       "D":"50 мT"
    },
    {
       "savol":"Magnit maydonning biror nuqtasining energetik xarakteristikasini tafsirlovchi fizik kattalik ... deb ataladi ",
       "A":" magnit maydon induksiyasi",
       "B":"magnit singdruvchanligi",
       "C":"induktivlik",
       "D":"magnit oqim"
    },
    {
       "savol":"Konturda o'tib turgan magnit induksiyasi kamaytrilsa, undan o'tayotgan magnit oqimi qanday o'zgaradi",
       "A":"o'zgarmaydi",
       "B":"oshadi",
       "C":"kamayadi",
       "D":"magnit oqim magnit induksiyasiga bog'liq emas"
    },
    {
       "savol":"Ayrim bir biri bilan bog'liq bo'lmagan yoki kuchsiz bo'lmagan molekulalar chiqargan yorug'lik qanday spektrga ega bo'ladi",
       "A":"tutash spektr",
       "B":"aralash spektr",
       "C":"chiziqli spektr",
       "D":"palasali spektr"
    },
    {
       "savol":"Tomoni 3 ga teng bo'lgan kub shaklidagi muz bo'lagi ichida qirrasi 2 m bo'lgan kub shaklidagi bo'shliq bor, muzning massasi qancha",
       "A":"25",
       "B":"27",
       "C":"23",
       "D":"22"
    },
    {
       "savol":"10 km balandlikdan 360 km/soat tezlik bilan uchayotgan samolyotning potensial energiyasi, uning kinetik energiyasidan necha marta ko'p",
       "A":"12",
       "B":"20",
       "C":"60",
       "D":"30"
    },
    {
       "savol":"Yorug'likning 30 min da bosib o'tgan yo'lini toping (c=3*10^8) m/s",
       "A":"5,4*10^9 km",
       "B":"5,4*10^8 km",
       "C":"5,4*10^9 m",
       "D":"5,4*10^8 m"
    },
    {
       "savol":"Jism tekis tezlanuvchan harakat qilib 20 m ni 4 sekunda bosib o'tdi. Keyingi 40 m ni 4 sekunda bosib o'tgan bo'lsa uning boshlang'ich tezligini toping m/s",
       "A":"2,5",
       "B":"1,15",
       "C":"1,25",
       "D":"4"
    },
    {
       "savol":"Moddiy nuqtaning radusi 3 m bo'lgan aylana bo'ylab 4rad/s burchak tezlik bilan teks harakatlanmoqda. Uning to'la tezlanishini toping m/s^2",
       "A":"48",
       "B":"36",
       "C":"0",
       "D":"12"
    },
    {
       "savol":"Jismning tinch yoki harakat holatini saqlash qobilyatini xarakterlovchi fizik kattalik ... deyiladi",
       "A":"Inertlik",
       "B":"Zichlik",
       "C":"Massa ",
       "D":"Og'irlik"
    }
 ]
